In [4]:
import pandas as pd

In [6]:
data = {'productname':['product A','product B','product C'], 'productprice':[22250,16600,12500]}
df = pd.DataFrame(data)
df

  productname  productprice
0   product A         22250
1   product B         16600
2   product C         12500

In [9]:
data = {'productname':['product A','product B','product C'], 'productprice':[22250,16600,12500]}
df = pd.DataFrame(data , index=['A', 'B', 'C'])
df

  productname  productprice
A   product A         22250
B   product B         16600
C   product C         12500

In [10]:
data = {'productname':['product A','product B','product C'], 'productprice':[22250,16600,12500]}
product_IDs=['A', 'B', 'C']
df = pd.DataFrame(data , index=product_IDs)
df

  productname  productprice
A   product A         22250
B   product B         16600
C   product C         12500

In [16]:
data = [['product A',22250],['product B',16600],['product C',12500]]
df = pd.DataFrame(data)
df

           0      1
0  product A  22250
1  product B  16600
2  product C  12500

In [18]:
df.columns = ['productname','productname']
df

   productname  productname
0    product A        22250
1    product B        16600
2    product C        12500

In [20]:
df.index=['A','B','C']
df

   productname  productname
A    product A        22250
B    product B        16600
C    product C        12500

In [21]:
df.shape

(3, 2)